Tekla.Structures.Catalogs.RebarItem
The RebarItem class contains information from the rebars in the catalog
(rebar_database.inp).

Tekla.Structures.Catalogs.RebarItem.#ctor
Creates a new rebar item instance.

Tekla.Structures.Catalogs.RebarItem.Grade
The rebar item's grade.

Tekla.Structures.Catalogs.RebarItem.Size
The rebar item's size.

Tekla.Structures.Catalogs.RebarItem.MAIN_USAGE
The main usage string.

Tekla.Structures.Catalogs.RebarItem.TIE_STIRRUP_USAGE
The tie/stirrup usage string.

Tekla.Structures.Catalogs.RebarItem.DIAGONAL_RATIO_STRING
The diagonal ratio string.

Tekla.Structures.Catalogs.RebarItem.DIAGONAL_DISTANCE_STRING
The diagonal distance string.

Tekla.Structures.Catalogs.RebarItem.HORIZONTAL_RATIO_STRING
The horizontal ratio string.

Tekla.Structures.Catalogs.RebarItem.HORIZONTAL_DISTANCE_STRING
The horizontal distance string.

Tekla.Structures.Catalogs.RebarItem.Usage
The rebar item's usage.

Tekla.Structures.Catalogs.RebarItem.BendRadius
The rebar item's bending radius.

Tekla.Structures.Catalogs.RebarItem.Code
The rebar item's code.

Tekla.Structures.Catalogs.RebarItem.NominalDiameter
The rebar item's nominal diameter.

Tekla.Structures.Catalogs.RebarItem.ActualDiameter
The rebar item's actual diameter.

Tekla.Structures.Catalogs.RebarItem.WeightPerLenght
The rebar item's weight per lenght.

Tekla.Structures.Catalogs.RebarItem.CrossSectionArea
The rebar item's cross section area.

Tekla.Structures.Catalogs.RebarItem.HookRadius90Degrees
The rebar item's hook radius for 90 degrees.

Tekla.Structures.Catalogs.RebarItem.HookLength90Degrees
The rebar item's hook length for 90 degrees.

Tekla.Structures.Catalogs.RebarItem.HookRadius135Degrees
The rebar item's hook radius for 135 degrees.

Tekla.Structures.Catalogs.RebarItem.HookLength135Degrees
The rebar item's hook length for 135 degrees.

Tekla.Structures.Catalogs.RebarItem.HookRadius180Degrees
The rebar item's hook radius for 180 degrees.

Tekla.Structures.Catalogs.RebarItem.HookLength180Degrees
The rebar item's hook length for 180 degrees.

Tekla.Structures.Catalogs.RebarItem.LapLength
Gets or sets the lap length.

Tekla.Structures.Catalogs.RebarItem.CrankStraightLength
Gets or sets the crank straight length.

Tekla.Structures.Catalogs.RebarItem.CrankedLengthType
Gets or sets the cranked length type.

Tekla.Structures.Catalogs.RebarItem.CrankedLength
Gets or sets the cranked length.

Tekla.Structures.Catalogs.RebarItem.CrankExtraOffset
Gets or sets the crank extra offset.

Tekla.Structures.Catalogs.RebarItem.Select(System.String,System.String,System.Double)
Selects the rebar item in the rebar database.
Grade: The grade of the rebar item to select.
Size: The size of the rebar item to select.
BendRadius: The bending radius of the rebar item to select.
Returns: True on success.

Tekla.Structures.Catalogs.RebarItem.Select(System.String,System.Double,System.Double,System.Boolean)
Selects the rebar item in the rebar database.
Grade: The grade of the rebar item to select.
Diameter: The diameter of the rebar item to select.
BendRadius: The bending radius of the rebar item to select.
UseNominalDiameter:
If set to false, the item is selected based on the actual diameter.
If true, the item is selected based on the nominal diameter.
Returns: True on success.

Tekla.Structures.Catalogs.RebarItem.Select(System.String,System.String,System.String)
Selects the rebar item in the rebar database.
Grade: The grade of the rebar item to select.
Size: The size of the rebar item to select.
Usage: The usage of the rebar item to select.
Returns: True on success.

Tekla.Structures.Catalogs.RebarItem.Select(System.String,System.Double,System.String,System.Boolean)
Selects the rebar item in the rebar database.
Grade: The grade of the rebar item to select.
Diameter: The diameter of the rebar item to select.
Usage: The usage of the rebar item to select.
UseNominalDiameter:
If set to false, the item is selected based on the actual diameter.
If true, the item is selected based on the nominal diameter.
Returns: True on success.

Tekla.Structures.Catalogs.RebarItem.Select(System.String,System.String)
Selects the rebar item in the rebar database.
Grade: The grade of the rebar item to select.
Size: The size of the rebar item to select.
Returns: True on success.

Tekla.Structures.Catalogs.RebarItem.Select(System.String,System.Double,System.Boolean)
Selects the rebar item in the rebar database.
Grade: The grade of the rebar item to select.
NominalDiameter: The diameter of the rebar item to select.
UseNominalDiameter:
If set to false, the item is selected based on the actual diameter.
If true, the item is selected based on the nominal diameter.
Returns: True on success.

Tekla.Structures.Catalogs.RebarItem.Delete
Deletes the rebar item from the rebar database.
Returns: True on success

Tekla.Structures.Catalogs.RebarItem.Insert
Inserts the rebar item in the rebar database.
Returns: True on success

Tekla.Structures.Catalogs.RebarItem.Modify(System.String,System.String,System.String)
Modifies the rebar item in the rebar database based on the given parameters.
OriginalGrade: Original Grade
OriginalSize: Original Size
OriginalUsage: Original Usage
Returns: True on success

Tekla.Structures.Catalogs.RebarItem.Export(System.String@)
Exports the rebar item in the catlog to given file name.
If path is not given rebar is exported to model folder.
If filename is empty rebar name is used as filename.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
RebarItem item = new RebarItem();
if (item.Select("A500HW", "10", RebarItem.MAIN_USAGE))
{
string filename = System.IO.Path.GetTempPath() + "\\" + "A500HW_10_MAIN";
if (item.Export(ref filename))
{
Console.WriteLine("A500HW exported successfully");
}
}
}
}
filename: The export file name of the item.
Returns: True on success.